[
	{
		"id": "A9F7B075-22E4-44F6-8519-F576C73D33B1",
		"name": "Lentil soup",
		"detail": "Enjoy this filling vegetarian soup with red lentils, carrots and leeks. It's low in calories and fat, and delivers three of your five-a-day.",
		"thumbnail": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lentil_soup-c6fa61c.jpg?quality=90&webp=true&resize=440,400",
		"time": {
			"preperation": 10,
			"cooking": 60
		},
		"servings": 4,
		"calories": 219,
		"vegetarian": true,
		"ingredients": [
			"2l vegetable or ham stock",
      		"150g red lentils",
      		"6 carrots, finely chopped",
      		"2 medium leeks, sliced (about 300g)",
      		"small handful of chopped parsley, to serve"
		],
		"steps": [
			"Heat the stock in a large pan and add the lentils. Bring to the boil and allow the lentils to soften for a few minutes.",
      		"Add the carrots and leeks, and season (don't add salt if you use ham stock as it will make it too salty). Bring to the boil, then reduce the heat, cover and simmer for 45 mins-1 hr until the lentils have broken down. Scatter over the parsley and serve with buttered bread, if you like."
		]
	}
]

// .init(
//       name: "Tomato penne with avocado",
//       image: URL(string: "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/mexican-penne-5cd4efb.jpg?quality=90&webp=true&resize=440,400"),
//       calories: 495,
//       servings: 2,
//       time: 30,
//       ingredients: [
//         "100g wholemeal penne",
//         "1 tsp rapeseed oil",
//         "1 large onion, sliced, plus 1 tbsp finely chopped",
//         "1 orange pepper, deseeded and cut into chunks",
//         "2 garlic cloves, grated",
//         "2 tsp mild chilli powder",
//         "1 tsp ground coriander",
//         "½ tsp cumin seeds",
//         "400g can chopped tomatoes",
//         "196g can sweetcorn in water",
//         "1 tsp vegetable bouillon powder",
//         "1 avocado, stoned and chopped",
//         "1/2 lime, zest and juice",
//         "handful coriander, chopped, plus extra to serve"
//       ],
//       steps: [
//         "Cook the pasta in salted water for 10-12 mins until al dente. Meanwhile, heat the oil in a medium pan. Add the sliced onion and pepper and fry, stirring frequently for 10 mins until golden. Stir in the garlic and spices, then tip in the tomatoes, half a can of water, the corn and bouillon. Cover and simmer for 15 mins.",
//         "Meanwhile, toss the avocado with the lime juice and zest, and the finely chopped onion.",
//         "Drain the penne and toss into the sauce with the coriander. Spoon the pasta into bowls, top with the avocado and scatter over the coriander leaves."
//       ]
//     ),
//     .init(
//       name: "Butternut & cinnamon oats",
//       image: URL(string: "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/butternut-and-cinnamon-oats-abf3f2d.jpg?quality=90&webp=true&resize=440,400"),
//       calories: 310,
//       servings: 4,
//       time: 20,
//       ingredients: [
//         "120g porridge oats",
//         "80g raisins",
//         "2 tsp ground cinnamon, plus a sprinkling to serve",
//         "large chunk butternut squash, peeled and coarsely grated (approx 320g grated weight)",
//         "2 x 150ml pots bio yogurt",
//         "25g walnuts roughly broken",
//         "milk, to serve (optional)"
//       ],
//       steps: [
//         "Tip the oats, raisins and cinnamon into a large bowl and pour over 1 litre cold water. Cover the bowl and leave to soak overnight.",
//         "The next morning, tip the contents into a large saucepan and stir in the grated squash. Cook for about 8-10 mins over a medium heat, stirring frequently, until the oats are cooked and the squash is soft. Add a little more water if it’s too thick.",
//         "Put half of the mixture in the fridge for the next day. Spoon the remainder into bowls, top each portion with 1 pot yogurt and half the nuts. Dust with cinnamon, then serve with a splash of milk."
//       ]
//     ),
//     .init(
//       name: "Avocado & bean triangles",
//       image: URL(string: "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/bean-avocado-thins-ec3795f.jpg?quality=90&webp=true&resize=440,400"),
//       calories: 354,
//       servings: 2,
//       time: 5,
//       ingredients: [
//         "3 triangluar bread thins",
//         "210g can red kidney beans, drained",
//         "1 tbsp finely chopped dill, plus extra for garnish",
//         "1/2 lemon, for squeezing",
//         "1 tomato, chopped",
//         "1 small avocado",
//         "1 small red onion, finely chopped"
//       ],
//       steps: [
//         "Follow our triangular bread thins recipe to make your own. While they bake, roughly mash the beans with the dill and a good squeeze of lemon then stir in the tomato.",
//         "Cut the bread triangles in half and top with the beans. Scoop the avocado into a bowl and roughly mash with a squeeze more lemon. Spoon the avocado onto the beans, scatter over the chopped onion, then garnish with the remaining dill."
//       ]
//     ),
//     .init(
//       name: "Duck ragu with pappardelle & swede",
//       image: URL(string: "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/duck-ragu-with-pappardelle-swede-cc2fad5.jpg?quality=90&webp=true&resize=440,400"),
//       calories: 471,
//       servings: 4,
//       time: 110,
//       ingredients: [
//         "2 tbsp olive oil",
//         "2 duck breasts, skin removed",
//         "1 onion, finely chopped",
//         "1 tsp fennel seeds",
//         "2 garlic cloves",
//         "1 bay leaf",
//         "½ small pack parsley, leaves picked and stalks finely chopped",
//         "8 thyme sprigs, leaves picked",
//         "150ml red wine",
//         "1 tbsp tomato purée",
//         "400g can plum tomatoes",
//         "200ml stock",
//         "1 tsp red wine vinegar",
//         "1 tbsp raisins",
//         "toasted pine nuts and parmesan, to serve",
//         "fresh pappardelle",
//         "750g swede (1 large or 2 small) peeled, then cut into thick ribbons using a vegetable peeler"
//       ],
//       steps: [
//         "Heat 1 tbsp of the olive oil in a large deep frying pan over a high heat and fry the duck breasts for 2 mins on either side until well browned, then set aside. Tip the fat from the frying pan into a dish (keep it for later use if you like), and turn the heat on the pan down to medium, then add the rest of the olive oil. Tip the onion and fennel seeds into the pan, add a large pinch of salt and cook for 5 mins until the onion is starting to soften. Crush in the garlic cloves, then add the bay leaf, parsley stalks and thyme leaves. Stir well and cook for 2 mins more.",
//         "Turn the heat up, then pour in the red wine and cook for 2 mins until it has reduced a little. Spoon in the tomato purée and tip in the can of tomatoes along with the stock, stir and bring to the boil, then turn the heat down to low and return the duck breasts to the pan, cover and simmer very gently for 40-45 mins or until the meat is tender.",
//         "Remove the duck breasts with a slotted spoon, put in a bowl, turn the heat up and reduce the tomato sauce for 10 mins until thick enough to coat your pasta. Use two forks to shred the duck, then tip the meat back into the sauce. Add the red wine vinegar and raisins, then season to taste. Set aside.",
//         "When ready to serve, cook your pasta. Heat a large pan of well salted water, add the pappardelle and cook following pack instructions. For the final minute of cooking time, drop in the swede. Drain, reserving a ladleful of the pasta water to add to the sauce. Toss the pasta and swede through the sauce. Divide between bowls and top with the toasted pine nuts, parmesan and a scattering of parsley."
//       ]
//     ),
//     .init(
//       name: "Chicken & lemon skewers",
//       image: URL(string: "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-lemon-skewers-31bd4db.jpg?quality=90&webp=true&resize=440,400"),
//       calories: 363,
//       servings: 4,
//       time: 45,
//       ingredients: [
//         "1 small pack mint, leaves picked",
//         "150g natural yogurt, plus extra to serve (optional)",
//         "1 lemon, zested and juiced",
//         "½ tsp ground cumin",
//         "½ tsp ground coriander",
//         "2cm piece ginger, grated",
//         "4 skinless chicken breasts, each cut into 6 pieces",
//         "4 wholemeal flatbreads or pittas",
//         "2 Little Gem lettuces, sliced",
//         "1 small red onion, sliced, to serve",
//         "pickled red cabbage, chilli sauce and hummus, to serve (all optional)"
//       ],
//       steps: [
//         "Chop half the mint and put in a bowl with the yogurt, half the lemon juice, all the lemon zest, spices and ginger. Mix well and season with lots of black pepper and a pinch of salt. Add the chicken pieces, mix well and put in the fridge for 20-30 mins. Meanwhile, soak 4 large wooden skewers in water for at least 20 mins (or use metal ones).",
//         "When you’re ready to cook the chicken, heat your grill to a medium heat and line the grill tray with foil. Thread the chicken onto the soaked wooden or metal skewers and grill for 15-20 mins, turning halfway through, until browned and cooked through.",
//         "Warm the flatbreads under the grill for a couple of seconds, then serve them topped with the lettuce, chicken, red onion, remaining lemon juice and mint, and any optional extras such as extra yogurt or pickled cabbage, chilli sauce and hummus."
//       ]
//     )